# 전력 사용량 데이터

In [77]:
import pandas as pd
df= pd.read_csv("1월1일.csv")
print(df['사용량 (kWh)'])

0     238.32
1     236.16
2     237.24
3     236.16
4     234.72
       ...
91    271.08
92    267.84
93    266.04
94    270.36
95    264.60
Name: 사용량 (kWh), Length: 96, dtype: float64

In [83]:
data_list=[]
for i in range(len(df)):
    id_name='a'
    time=str(df['시'][i])
    power=str(df['사용량 (kWh)'][i])
    name='서울지방경찰청'
    data_list.append((id_name, time, power,name))

In [66]:
import pymysql
testDB=pymysql.connect(host='localhost', user='root', password='1234', db='testDB', charset='utf8')
cursor=testDB.cursor()

cursor.execute("CREATE TABLE power_table (id VARCHAR(3), time VARCHAR(8), power VARCHAR(32), name VARCHAR(32))")

0

In [72]:
sql = "INSERT INTO power_table(id, time, power, name) VALUES (%s, %s, %s, %s)"

cursor.executemany(sql, data_list)

testDB.commit()

print(cursor.rowcount)

96

In [80]:
df2=pd.read_csv('1월2일.csv')
df2

        시  사용량 (kWh)
0   00:15     270.00
1   00:30     263.52
2   00:45     266.40
3   01:00     255.60
4   01:15     253.80
..    ...        ...
91  23:00     272.16
92  23:15     269.28
93  23:30     274.32
94  23:45     271.44
95  24:00     267.12

[96 rows x 2 columns]

In [84]:
data_list2=[]
for i in range(len(df2)):
    id_name='b'
    time=str(df2['시'][i])
    power=str(df2['사용량 (kWh)'][i])
    name='광화문우체국'
    data_list2.append((id_name, time, power,name))

In [82]:
sql = "INSERT INTO power_table(id, time, power, name) VALUES (%s, %s, %s, %s)"

cursor.executemany(sql, data_list2)

testDB.commit()

print(cursor.rowcount)

96